[
    {
        "id": 1,
        "title": "Overwhelmed but Grateful",
        "date": "2025-03-19 21:15:00",
        "content": "Today was one of those nonstop days. Teaching, mentoring, replying to messages—it felt like I was being pulled in five directions. But when I paused to reflect, I realized how far I’ve come. A year ago, I prayed for opportunities like this."
    },
    {
        "id": 2,
        "title": "Students’ Curiosity Sparked",
        "date": "2025-03-20 18:45:00",
        "content": "During today’s biology class, the students got really engaged while we discussed the circulatory system. Their curiosity was infectious. Moments like this remind me that teaching is not just a job, it's a purpose."
    },
    {
        "id": 3,
        "title": "Emotional Check-In",
        "date": "2025-03-21 22:10:00",
        "content": "I felt emotionally drained today. I think I need to start creating more space for myself in the evenings. Even 30 minutes of quiet reflection or journaling might help me ground myself again."
    },
    {
        "id": 4,
        "title": "Breakthrough in Thesis Writing",
        "date": "2025-03-22 20:30:00",
        "content": "Spent the afternoon comparing my interview findings with the Child-Friendly Schools framework. The connection between physical safety and academic performance is becoming clearer. I finally feel like the discussion chapter is taking shape."
    },
    {
        "id": 5,
        "title": "Swim, Sunlight, and Serenity",
        "date": "2025-03-23 16:00:00",
        "content": "I went for a swim and then sat outside for a while, soaking up the sun. I forget how healing it is to just be in nature, away from screens and schedules. I needed this reset."
    },
    {
        "id": 6,
        "title": "Mentoring Wins",
        "date": "2025-03-24 19:30:00",
        "content": "One of my mentees told me that our sessions helped her feel more confident about her future. That felt so meaningful. It reminded me that even small, consistent support can leave a lasting impact."
    },
    {
        "id": 7,
        "title": "Quiet Reflection",
        "date": "2025-03-25 21:00:00",
        "content": "I turned off all notifications tonight and sat quietly with a cup of tea. I thought about my journey—everything I’ve done, and everything I still dream of doing. Silence can be so powerful."
    },
    {
        "id": 8,
        "title": "Apartment Hunting Worries",
        "date": "2025-03-26 20:45:00",
        "content": "Spent the evening checking mortgage options and apartment prices. It’s a lot to think about. I want to make the right choice, not just financially, but for my future peace of mind."
    },
    {
        "id": 9,
        "title": "Classroom Moments",
        "date": "2025-03-27 17:10:00",
        "content": "One of my students stayed after class to ask more about diabetes and how insulin works. It made me so happy to see that spark in her eyes. Curiosity really is the beginning of lifelong learning."
    },
    {
        "id": 10,
        "title": "Gratitude and Growth",
        "date": "2025-03-28 22:00:00",
        "content": "Looking back at this week, I feel tired but proud. I kept going despite the challenges. I made progress in my thesis. I showed up for my students and mentees. And I showed up for myself. That counts."
    }
]